[net]
batch=100
subdivisions=1
height=28
width=28
channels=1
max_crop=28
min_crop=28

hue=.1
saturation=.75
exposure=.75

learning_rate=0.1
policy=poly
power=4
max_batches = 10000
momentum=0.9
decay=0.0005

[connected]
output= 100
activation=relu

[connected]
output= 30
activation=relu

[connected]
output= 10
activation=relu

[softmax]
